app/views/shared/_user_info.html.erb

<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.items.count, "item") %></span>
---
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]