app/controllers/items_controller.rb

INSERT INTO "items" ("content", "price", "company", "enddate", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = current_user.items.build(item_params)
    if @item.save